public class Main {
    public static void main(String[] args) {
        /*
    1.Создайте новый проект, залинкуйте его с удаленным репозиторием на GitHub, добавьте файл .gitignore
    и сделайте коммит
    2.Создайте класс абстрактный класс Vehicle (средство передвижения)
    3. У класса Vehicle создайте поле wheelCount типа int и модификатором доступа protected
    4. Создайте конструктор с аргументом wheelCount
    5. Создайте абстрактный метод printInfo() (protected void), который будет реализован
    в классах-наследниках и будет выводить информацию о конкретном средстве передвижения
    6. Создайте класс Car (наследник класса Vehicle)
    7. Добавьте в класс Car поле doorsCount (private int) и создайте конструктор с 2-мя
    аргументами (wheelCount и doorsCount)
    8. Реализуйте в классе Car метод printInfo() - должен выводить на экран информацию о машине
    (Пример вывода: “Транспортное средство: Машина - Количество дверей: 5 - Количество колес: 4”)
    9. Создайте класс Motorcycle (наследник класса Vehicle)
    10. Добавьте в класс Motorcycle поле maxSpeed (private int) и создайте конструктор
    с 2-мя аргументами (wheelCount и maxSpeed)
    11. Реализуйте в классе Motorcycle метод printInfo() - должен выводить на экран
    информацию о мотоцикле (Пример вывода: “Транспортное средство:
    Мотоцикл- Количество колес: 2 - Максимальная скорость: 170 км/ч”)
    12. Создайте интерфейс Costable и в него добавьте метод getCost() с возвращаемым типом int
    13. Реализуйте интерфейс Costable для класса Car (реализация на ваше усмотрение).
    Добавить информацию о цене в метод printInfo()
    14. Для реализации работы программы создайте по 2 экземпляра классов Car и Motorcycle.
    Продемонстрировать работу каждого из методов классов и вывести результат на консоль
    15. Залить код в репозиторий и отправить ссылку на репозиторий преподавателю
    */
    }
}